# SurfaceTriangulationFailed Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SiteFailures..::..SurfaceTriangulationFailed Property
BuiltInFailures..::..SiteFailures Class See Also
---
The Site Surface failed to triangulate.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SurfaceTriangulationFailed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SurfaceTriangulationFailed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SurfaceTriangulationFailed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SiteFailures Class
Autodesk.Revit.DB Namespace